mabeth_borres/rails_oceans_of_the_earth/app/controllers/oceans_controller.rb

    def index
        @oceans = Ocean.all
---
SELECT "oceans".* FROM "oceans"

    def show
        @ocean = Ocean.find params[:id]
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

    def create
        s = params[:continents].join(', ')
        ocean = Ocean.create oceans_params
        ocean.continents = s
        ocean.save
---
INSERT INTO "oceans" ("name", "knownexplorers", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Sample Ocean"], ["knownexplorers", ""], ["image", ""], ["created_at", "2019-04-16 17:05:59.592792"], ["updated_at", "2019-04-16 17:05:59.592792"]]
UPDATE "oceans" SET "continents" = ?, "updated_at" = ? WHERE "oceans"."id" = ?  [["continents", "North America, South America, Australia"], ["updated_at", "2019-04-16 17:18:23.476576"], ["id", 21]]
INSERT INTO "oceans" ("name", "knownexplorers", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Sample Ocean 3"], ["knownexplorers", ""], ["image", ""], ["created_at", "2019-04-16 17:14:37.056775"], ["updated_at", "2019-04-16 17:14:37.056775"]]

    def edit
        @ocean = Ocean.find params[:id]
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

    def update
        ocean = Ocean.find params[:id]
        s = params[:continents].join(', ')
        ocean.update oceans_params
        ocean.continents = s
        ocean.save
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "oceans" SET "image" = ?, "knownexplorers" = ?, "updated_at" = ? WHERE "oceans"."id" = ?  [["image", ""], ["knownexplorers", ""], ["updated_at", "2019-04-17 20:46:00.749771"], ["id", 12]]
UPDATE "oceans" SET "continents" = ?, "updated_at" = ? WHERE "oceans"."id" = ?  [["continents", "Africa, Europe, North America, South America, Australia"], ["updated_at", "2019-04-17 20:46:00.754026"], ["id", 12]]