sam_seabourn/week05/oceans/oceans/app/controllers/oceans_controller.rb

SELECT  "oceans".* FROM "oceans" ORDER BY "oceans"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
def index
  @oceans = Ocean.all