monica_mendes_montanha/week05/day22/mountains/app/controllers/mountains_controller.rb

  def create
    mountain = Mountain.create mountain_params
---
INSERT INTO "mountains" ("name", "country", "city", "image") VALUES (?, ?, ?, ?)  [["name", "El Capitan"], ["country", "Australia"], ["city", "HAYMARKET"], ["image", "https://n7tpw52zdt-flywheel.netdna-ssl.com/wp-content/uploads/2016/06/El-Capitan-1.jpg"]]

  def update
    mountain = Mountain.find params[:id]
    mountain.update mountain_params
---
SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "mountains" SET "image" = ? WHERE "mountains"."id" = ?  [["image", "https://n7tpw52zdt-flywheel.netdna-ssl.com/wp-content/uploads/2016/02/Mount-Kilimanjaro-02.jpg"], ["id", 3]]